Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: HoursBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: HoursBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных часов между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete hours between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Условие - логическое выражение; Значение1, Значение2 - выражения любых типов
en: Antecedent - logical expression; Value1, Value2 - expressions of any types

source: IF(Условие, Значение1, Значение2)
en: IF(Antecedent, Value1, Value2)

source: Возвращает Значение1, если Условие истинно или Значение2, если ложно. Результат функции имеет переменный тип
en: Returns Value1 if the Antecedent is true or Value2 if it is false. The function result has the variant type

source: Условие - логическое выражение; Значение1, Значение2 - числовые выражения или выражения типа Дата/время
en: Antecedent - logical expression; Value1, Value2 - numeric expressions or expressions of the Date/time type

source: IFF(Условие, Значение1, Значение2)
en: IFF(Antecedent, Value1, Value2)

source: Возвращает Значение1, если Условие истинно или Значение2, если ложно.
en: Returns Value1 if the Antecedent is true or Value2 if it is false.

source: Значение - значение искомого элемента; Элемент1, Элемент2, ЭлементN - значения элементов списка
en: Value - value of the target element; Element1, Element2, ElementN - values of the list elements

source: Строка - строка, для которой рассчитывается SHA512 значение.
en: String - a string for which the SHA512 value is calculated.

source: Строка - строка, для которой рассчитывается CRC32 значение.
en: String - a string for which the CRC32 value is calculated.

source: IN(Значение, Элемент1, Элемент2, ..., ЭлементN)
en: N(Value, Element1, Element2, ..., ElementN)

source: Функция возвращает значение логического типа True (истина), если Значение содержится в списке, иначе результат равен False (ложь).
en: Function returns the True value of the logical type if the Value is in the list, otherwise the result is False.

source: Int(Аргумент)
en: Int(Argument)

source: Возвращает целую часть Аргумента.
en: Returns the integer part of the Argument.

source: Аргумент - числовое выражение;
en: Argument - numeric expression;

source: IsInfinite(Аргумент)
en: IsInfinite(Argument)

source: Определяет, является ли переданное значение бесконечным числом.
en: Determines whether the transferred value is an infinite number.

source: Аргумент - любое выражение;
en: Argument - any expression;

source: IsNull(Аргумент)
en: IsNull(Argument)

source: SHA512(Строка)
en: SHA512(String)

source: Проверяет, является ли Аргумент пустым. Возвращает логическое значение.
en: Checks whether the Argument is null. Returns the logical value.

source: Аргумент - строковое выражение, содержащее дату/время в формате ISO 8601
en: Argument - the string expression containing date/time in ISO 8601 format

source: ISO8601ToDate(Аргумент)
en: ISO8601ToDate(Argument)

source: Функция конвертирует строку, содержащую дату/время в формате ISO 8601 в значение типа "Дата/Время". При указанном смещении времени относительно UTC дата/время приводится к текущей временной зоне. Если смещение времени не указано, дата/время остаётся без изменений.
en: Function converts the string containing date/time in ISO 8601 format into the "Date/Time" value type. In the context of the specified time offset with regard to UTC, the date/time is set to the current time zone. If the time offset is not specified, the date/time remains unchanged.

source: Строка - выражение строкового типа.
en: String - expression of the string type.

source: Left(Строка, Количество_символов)
en: Left(String, Count_of_characters)

source: Возвращает заданное количество символов левой части строки.
en: Returns the given count of characters of the left string part.

source: LevDist(Строка1, Строка2)
en: LevDist(String1, String2)

source: Функция возвращает значение расстояния Левенштейна для строк Строка1, Строка2. Расстояние Левенштейна также называют расстоянием редактирования, которое является мерой похожести двух строк. Результат - это минимальное количество операций удалений, вставки и замены символа, которое нужно произвести, чтобы преобразовать одну строку в другую.
en: The function returns the Levenshtein distance for strings String1, String2. The Levenshtein distance is an edit distance, a metric of similarity between two strings. The value returned is the minimum number of operations (consisting of insertions, deletions or substitutions of a single character) required to change one string into the other.

source: Функция возвращает HEX значение SHA512, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA512 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: Аргумент - положительное числовое выражение.
en: Argument - positive numeric expression.

source: Ln(Аргумент)
en: Ln(Argument)

source: Возвращает натуральный логарифм аргумента.
en: Returns the natural argument logarithm.

source: Основание - числовое выражение; Аргумент - положительное числовое выражение.
en: Basis - numeric expression; Argument - positive numeric expression.

source: Log(Основание, Аргумент)
en: Log(Basis, Argument)

source: Возвращает логарифм аргумента с заданным основанием.
en: Returns the argument logarithm with the given basis.

source: Аргумент - строковое выражение.
en: Argument - string expression.

source: Lower(Аргумент)
en: Lower(Argument)

source: Возвращает аргумент в нижнем регистре.
en: Returns the lowercase argument.

source: Аргумент1, Аргумент2, ... - числовые выражения.
en: Argument1, Argument2, ... - numeric expressions.

source: Строка - строка, для которой рассчитывается SHA512/224 значение.
en: String - a string for which the SHA512/224 value is calculated.

source: Max(Аргумент1, Аргумент2 ...)
en: Max(Argument1, Argument2 ...)

source: Возвращает максимальное из аргументов.
en: Returns the maximum argument.

source: MillisecondsBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: MillisecondsBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных миллисекунд между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete milliseconds between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Min(Аргумент1, Аргумент2 ...)
en: Min(Argument1, Argument2 ...)

source: Возвращает минимальное из аргументов.
en: Returns the minimum argument.

source: Minute(ДатаВремя)
en: Minute(DateTime)

source: SHA512_224(Строка)
en: SHA512_224(String)

source: Возвращает минуты по заданной дате/времени.
en: Returns minutes according to the specified date/time.

source: MinutesBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: MinutesBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных минут между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete minutes between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Mod(Делимое, Делитель)
en: Mod(Dividend, Divisor)

source: Возвращает остаток от целочисленного деления Делимого на Делитель.
en: Returns remainder from integer division of the Dividend by the Divisor.

source: Month(Дата)
en: Month(Date)

source: Возвращает месяц по заданной дате.
en: Returns the month according to the specified date.

source: Функция возвращает HEX значение SHA512/224, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA512/224 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: MonthsBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: MonthsBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных месяцев между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete months between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Применяется для построения пользовательской модели простого скользящего среднего в пользовательских моделях. Формула вычисления скользящего среднего: MA = (X(t) + ... + X(t - n))/n.
en: Used in user models for building a user model of a simple moving average. The moving average formula: MA = (X(t) + ... + X(t - n))/n.

source: Аргументы отсутствуют.
en: Arguments are absent.

source: Возвращает текущую дату и время. Так как текущая дата и время - это время вычисления выражения, которое считается каждый раз при получении значения этого выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то можно, при наличии параметра выражения "Кэшировать" включить эту опцию.
en: Returns the current date and time. The current date and time represent the time the expression gets calculated, and it is calculated each time the expression's value is retrieved, for example, when viewing results in a tabular form or exporting data. Thus, it is generally recommended to enable the "Cache" expression parameter when it is available.

source: Строка - строка, для которой рассчитывается SHA512/256 значение.
en: String - a string for which the SHA512/256 value is calculated.

source: Функция возвращает пустое значение.
en: Function returns the null value.

source: Выражение - любое строковое или числовое выражение. Значение_по_умолчанию - необязательный параметр, строковое или числовое выражение, значение которого возвращается, если Выражение равно Null.
en: Expression - any string or numeric expression. Default_value - optional parameter, string or numeric expression value of which is returned if the Expression is equal to Null.

source: NVL(Выражение [, Значение_по_умолчанию = ""])
en: NVL(Expression [, Default_value = ""])

source: Возвращает значение Выражения, если оно не равно Null, и Значение_по_умолчанию в противном случае.
en: Returns the Expression value if it is not equal to Null, and Default_value otherwise.

source: ЧисловоеВыражение - исходное выражение, которое может быть числом или Null. Значение_по_умолчанию - необязательный параметр, числовое выражение, значение которого возвращается, если ЧисловоеВыражение равно Null.
en: NumericExpression - the original expression, which can be a number or Null. Value_by_default - an optional parameter, a numeric expression, the value of which is returned if NumericExpression is Null.

source: NVLF(ЧисловоеВыражение [, Значение_по_умолчанию = 0])
en: NVLF(NumericExpression [, Value_by_default = 0])

source: Возвращает ЧисловоеВыражение, если оно не равно Null, и Значение_по_умолчанию в противном случае.
en: Returns NumericExpression if it is not Null, else Value_by_default.

source: SHA512_256(Строка)
en: SHA512_256(String)

source: Возвращает значение константы "ПИ" 3.1415926535897932385.
en: Returns the pi constant value 3.1415926535897932385.

source: Аргумент - числовое выражение; Степень - числовое выражение;
en: Argument - numeric expression; Degree - numeric expression;

source: Pow(Аргумент, Степень)
en: Pow(Argument, Degree)

source: Возвращает аргумент в заданной степени.
en: Returns the argument raised to the specified power.

source: QuartersBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: QuartersBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных кварталов между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_Значение = True, то функция вернёт модуль значения
en: Returns the number of complete quarters between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Возвращает псевдослучайное равномерно распределенное число, большее или равное 0 и меньше 1. Так как случайное число будет генерироваться каждый раз при получении значения выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то в общем случае рекомендуется при наличии параметра выражения "Кэшировать" включить эту опцию.
en: Returns pseudorandom evenly distributed number larger or equal to 0 and less than 1. As a random number will be generated each time when getting the expression value, for example, when viewing the result in tabular form or executing data export, it is generally recommended to enable the "Cache" expression parameter if it is available.

source: Функция возвращает HEX значение SHA512/256, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA512/256 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: Аргументы - любые числовые выражения.
en: Arguments - any numeric expressions.

source: RelErr(Аргумент1, Аргумент2)
en: RelErr(Argument1, Argument2)

source: Возвращает относительную погрешность двух аргументов.
en: Returns the relative error of two arguments.

source: Строка - строковое выражение. Количество_повторов - целое выражение
en: String - string expression. Count_of_repeats - integer

source: Repeat(Строка, Количество_повторов)
en: Repeat(String, Count_of_repeats)

source: Возвращает строку - повторяющую заданную строку необходимое количество раз.
en: Returns a string - repeating the given string as many times as necessary.

source: Строка - строка, в которой необходимо сделать замену; Старый_шаблон - заменяемая подстрока; Новый_шаблон - строка, на которую будет заменяться Старый шаблон; Заменять_все - флаг замены всех вхождений Старого шаблона на Новый шаблон. Аргумент логического типа; Игнорировать_регистр - флаг чувствительности к регистру при замене. Аргумент логического типа.
en: String - the string in which a replacement is required; Old_template - the replaced substring; New_template - the string with which the Old template will be replaced; Replace_all - flag of replacement of all occurrences of the Old template with the New template. Argument of the logical type; Ignore_case - flag of case sensitivity in case of replacement. Argument of the logical type.

source: Replace(Строка, Старый_шаблон, Новый_шаблон [, Заменять_все, Игнорировать_регистр])
en: Replace(String, Old_template, New_template [, Replace_all, Ignore_case])

source: Функция возвращает Строку, в которой вхождения Старого шаблона были заменены на Новый шаблон. Если флаг "Заменять все" имеет значение True (истина), то в возвращаемой строке будут заменены все вхождения Старого Шаблона на Новый шаблон. Если флаг "Заменять все" имеет значение False (ложь), то в возвращаемой строке будет заменено только первое по порядку вхождение. Если флаг "Игнорировать регистр" имеет значение True (истина), то поиск заменяемых фрагментов (Старый шаблон) будет регистронезависимым. Если флаг "Игнорировать регистр" имеет значение False (ложь), то поиск заменяемых фрагментов (Старый шаблон) будет регистрозависимым. Последние два параметра можно не указывать. Если не указан флаг "Игнорировать регистр", то поиск заменяемых фрагментов будет регистрозависимым . Если не указан флаг "Заменять все", то будет заменено только первое вхождение заменяемой подстроки. Например, Replace("A000a00A", "A", "B", True, True) вернет строку "B000B00B" , т.е. заменит все вхождения строки "A" на строку "B" игнорируя регистр символов; Replace("A000a00A", "A", "B", True, False) вернет строку "B000a00B". Replace("A000a00A", "A", "B") вернет строку "B000a00A".
en: The function returns the String where occurrences of the Old Template have been substituted with the New Template. If the "Replace all" flag is True, all occurrences of the Old Template will be replaced with the New Template in the returned string. If "Replace all" is False, only the first occurrence will be replaced. If the "Ignore case" flag is True, the search for the fragments to replace (the Old Template) will be case-insensitive. If "Ignore case" is False, the search for the Old Template will be case-sensitive. The last two parameters may be not specified. If "Ignore case" is not specified, the search will be case-sensitive. If "Replace all" is not specified, only the first occurrence of the Old Template will be replaced. For example, Replace("A000a00A", "A", "B", True, True) returns "B000B00B" (all occurrences of string "A" replaced with string "B", ignoring case). Replace("A000a00A", "A", "B", True, False) returns "B000a00B". Replace("A000a00A", "A", "B") returns "B000a00A".

source: ИмяПоля - поле, по которому необходимо получить накапливающуюся сумму ИмяПоляГруппы - поле, по которому происходит группировка данных. Этот параметр не является обязательным. Если этот параметр указан, то накапливающиеся суммы считаются в пределах групп.
en: FieldName - the field for which the cumulative sum needs to be obtained GroupFieldName - the field by which data is grouped. This is an optional parameter. If this parameter is set, cumulative sums get calculated within groups.

source: Right(Строка, Количество_символов)
en: Right(String, Count_of_characters)

source: Возвращает заданное количество символов правой части строки.
en: Returns the given count of characters of the right string part.

source: Аргумент1 - числовое выражение, Аргумент2 - необязательный параметр, количество цифр после запятой, целое число.
en: Argument1 - numeric expression, Argument2 - optional parameter, the number of digits following the decimal point, integer.

source: Round(Аргумент1 [, Аргумент2 = 0])
en: Round(Argument1 [, Argument2 = 0])

source: Округляет вещественное число до ближайшего числа, имеющего указанное количество цифр после запятой.
en: Rounds a real number to a given decimal place.

source: RoundDown(Аргумент1 [, Аргумент2 = 0])
en: RoundDown(Argument1 [, Argument2 = 0])

source: Округляет вещественное число вниз до числа, имеющего указанное количество цифр после запятой.
en: Rounds a real number down to a given decimal place.

source: RoundUp(Аргумент1 [, Аргумент2 = 0])
en: RoundUp(Argument1 [, Argument2 = 0])

source: CumulativeSum("ИмяПоля" [, "ИмяПоляГруппы"])
en: CumulativeSum("FieldName" [, "GroupFieldName"])

source: CRC32(Строка)
en: CRC32(String)

source: Округляет вещественное число вверх до числа, имеющего указанное количество цифр после запятой.
en: Rounds a real number up to a given decimal place.

source: Second(ДатаВремя)
en: Second(DateTime)

source: Возвращает секунды по заданной дате/времени.
en: Returns seconds according to the specified date/time.

source: SecondsBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: SecondsBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных секунд между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete seconds between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Sign(Аргумент)
en: Sign(Argument)

source: Возвращает знак аргумента.
en: Returns the argument sign.

source: Функция возвращает накапливающуюся сумму по полю. Примечание: ИмяПоля и ИмяПоляГруппы - строковые значения, т.е. явно заданные ИмяПоля и ИмяПоляГруппы должны быть указаны в кавычках. Например: CumulativeSum("COL1", "COL2")
en: Function returns the cumulative sum according to the field. Note: FieldName and GroupFieldName are string values, namely, the explicitly given FieldName and GroupFieldName must be specified in quotation marks. For example: CumulativeSum("COL1", "COL2")

source: Sin(Угол)
en: Sin(Angle)

source: Возвращает синус заданного угла.
en: Returns the sine of the set angle.

source: Количество_пробелов - целое выражение.
en: Count_of_spaces - integer.

source: Space(Количество_пробелов)
en: Space(Count_of_spaces)

source: Возвращает заданное количество пробелов.
en: Returns the given count of spaces.

source: Sqrt(Аргумент)
en: Sqrt(Argument)

source: Возвращает квадратный корень аргумента.
en: Returns the square root of the argument.
